Tutorial followed: https://realpython.com/python-data-cleaning-numpy-pandas/#combining-str-methods-with-numpy-to-clean-columns

In [103]:
import pandas as pd
import numpy as np
import re

books = pd.read_csv(r"C:\Users\kalya\Desktop\practise\data cleaning practise\Datasets\BL-Flickr-Images-Book.csv")
olympics = pd.read_csv(r"C:\Users\kalya\Desktop\practise\data cleaning practise\Datasets\olympics.csv")

1. **Books dataset**

In [104]:
books.isna().all()

Identifier                False
Edition Statement         False
Place of Publication      False
Date of Publication       False
Publisher                 False
Title                     False
Author                    False
Contributors              False
Corporate Author           True
Corporate Contributors     True
Former owner              False
Engraver                   True
Issuance type             False
Flickr URL                False
Shelfmarks                False
dtype: bool

In [105]:
books.drop(columns = ['Corporate Author','Corporate Contributors','Engraver'],inplace = True, axis = 'column')

In [106]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8287 entries, 0 to 8286
Data columns (total 12 columns):
Identifier              8287 non-null int64
Edition Statement       773 non-null object
Place of Publication    8287 non-null object
Date of Publication     8106 non-null object
Publisher               4092 non-null object
Title                   8287 non-null object
Author                  6509 non-null object
Contributors            8287 non-null object
Former owner            1 non-null object
Issuance type           8287 non-null object
Flickr URL              8287 non-null object
Shelfmarks              8287 non-null object
dtypes: int64(1), object(11)
memory usage: 777.0+ KB

In [107]:
#books.iloc[35]

books['Place of Publication'].iloc[30:100]

30                              Abingdon
31                                Quebec
32                                London
33                                London
34                               Leipzig
35    pp. 40. W. Cann: Plymouth, [1876?]
36                                London
37                                London
38                                London
39                                  1845
40                                London
41                                London
42                                   enk
43                                London
44                                Boston
45                                London
46                               Upsaliæ
47                                London
48                             Edinburgh
49                               Yverdon
50                               Londini
51                        St. Petersburg
52                                Berlin
53                                London
54                                London
55                                London
56                                London
57                                Sceaux
58                                London
59                               Coblenz
                     ...
70                                London
71                                London
72                                London
73                             A. Millar
74                              New York
75                            Allahabad]
76                                London
77                             Stuttgart
78                                London
79                      D. Appleton & Co
80                                London
81                       Санктпетербургъ
82                                London
83                               Paisley
84                                London
85                                London
86                                London
87                                London
88                                London
89                                London
90                                London
91                                London
92                                London
93                                 Paris
94                                London
95                             Edinburgh
96                                Napoli
97                                London
98                          Ἐν Κερκυρᾳ
99                                London
Name: Place of Publication, Length: 70, dtype: object

In [108]:
books['Place of Publication'] = np.where(books['Place of Publication'].str.contains('London'),'London',
        np.where(books['Place of Publication'].str.contains('Oxford'),'Oxford',
                np.where(books['Place of Publication'].str.contains('Plymouth'),'Plymouth',
                        books['Place of Publication'].str.replace('-',' '))
                )
        )

In [109]:
books['Place of Publication'].sample(20)

2527                   London
7902                   London
3406              Scarborough
3326                   London
892                    London
5645                   London
4294                   London
6492                     Bern
1187                    Paris
2809                   Dublin
4890                   Sydney
944                    La Paz
6137                   London
3103            С. Петербургъ
2382                   London
610                   Belfast
7772                   London
2211    Санктпетербургъ, 1867
6817                   London
1868               Cupar Fife
Name: Place of Publication, dtype: object

In [110]:
books['Identifier'].is_unique

True

In [111]:
books.set_index('Identifier',inplace = True)

In [112]:
books.head(2)

,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Former owner,Issuance type,Flickr URL,Shelfmarks
Identifier,,,,,,,,,,,
206,NaN,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12641.b.30.
216,NaN,London,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12626.cc.2.

In [139]:
#books['Date of Publication'] = books['Date of Publication'].str.extract(r'(^\d[4])')

#books['DateofP'] = books['Date of Publication'].str.extract(r'^(\d{4})')

['Date of Publication'] = books['Date of Publication'].str.extract(r'^(\d{4})')

#re.split
#expand =

2. **Olympics dataset**

In [46]:
olympics.head(5)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,? Summer,01 !,02 !,03 !,Total,? Winter,01 !,02 !,03 !,Total,? Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [48]:
olympics = pd.read_csv(r"C:\Users\kalya\Desktop\practise\data cleaning practise\Datasets\olympics.csv", header = 1)

In [49]:
olympics.head()

,Unnamed: 0,? Summer,01 !,02 !,03 !,Total,? Winter,01 !.1,02 !.1,03 !.1,Total.1,? Games,01 !.2,02 !.2,03 !.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [55]:
#column_names are taken from the source https://en.wikipedia.org/wiki/All-time_Olympic_Games_medal_table
column_names = ['Country','No. of Summer Games','Gold','Silver','Bronze','Total'
               ,'No. of Winter Games','Gold','Silver','Bronze','Total'
               ,'No. of Combined Games','Gold','Silver','Bronze','Combined Total']

cols = olympics.columns

In [78]:
col_mapper = {}

for ele in zip(cols,column_names):
    col_mapper[ele[0]] = ele[1]

**In below 2 cells, the zip iterator is exhausted after its 1st print.**

In [80]:
tup = zip(cols,column_names)
for i in tup:
    print(i)

('Unnamed: 0', 'Country')
('? Summer', 'No. of Summer Games')
('01 !', 'Gold')
('02 !', 'Silver')
('03 !', 'Bronze')
('Total', 'Total')
('? Winter', 'No. of Winter Games')
('01 !.1', 'Gold')
('02 !.1', 'Silver')
('03 !.1', 'Bronze')
('Total.1', 'Total')
('? Games', 'No. of Combined Games')
('01 !.2', 'Gold')
('02 !.2', 'Silver')
('03 !.2', 'Bronze')
('Combined total', 'Combined Total')

In [82]:
list(tup)

[]

In [84]:
olympics.rename(col_mapper,axis = 'columns',inplace = True)

In [87]:
olympics.sample(4)

,Country,No. of Summer Games,Gold,Silver,Bronze,Total,No. of Winter Games,Gold,Silver,Bronze,Total,No. of Combined Games,Gold,Silver,Bronze,Combined Total
122,Syria (SYR),12,1,1,1,3,0,0,0,0,0,12,1,1,1,3
91,Niger (NIG),11,0,0,1,1,0,0,0,0,0,11,0,0,1,1
61,Iraq (IRQ),13,0,0,1,1,0,0,0,0,0,13,0,0,1,1
24,Colombia (COL),18,2,6,11,19,1,0,0,0,0,19,2,6,11,19

3. **university_towns**

In [188]:
file = open(r"C:\Users\kalya\Desktop\practise\data cleaning practise\Datasets\university_towns.txt",'r')

In [189]:
list_unis = []
for line in file:
    if '[edit]' in line:
        state = line
    else:
        list_unis.append((state,line))

In [193]:
file.close()

In [194]:
file.closed

True

In [182]:
df = pd.DataFrame(list_unis, columns = ['State','University'])

In [183]:
df.State = df.State.str[:-7]
df.University = df.University.str[:-1]
#'\n' is considered as 1 character in the string. Hence -7 and not -8

In [195]:
df.sample(5)

          State                                         University
298    New York  Rochester (University of Rochester, Rochester ...
250    Nebraska                     Wayne (Wayne State College)[2]
20   California              Arcata (Humboldt State University)[5]
237    Missouri  Kirksville (Truman State University, A. T. Sti...
150   Louisiana   Lafayette (University of Louisiana at Lafayette)